Repository: bristisamanta/vita-stream-fronted
Catalog: lib/l10n/app_*.arb
Languages: bn, hi

source: Pair Device
bn: ডিভাইস পেয়ার করুন
hi: डिवाइस पेयर करें

source: Dashboard
bn: ড্যাশবোর্ড
hi: डैशबोर्ड

source: Map
bn: মানচিত্র
hi: मानचित्र

source: Tips
bn: টিপস
hi: टिप्स

source: Safe Water Sources
bn: নিরাপদ জল উৎস
hi: सुरक्षित जल स्रोत

# languageEnglish
source: English
bn: ইংরেজি
hi: अंग्रेज़ी

# languageHindi
source: Hindi
bn: হিন্দি
hi: हिन्दी

# languageBengali
source: Bengali
bn: বাংলা
hi: बंगाली

# notificationUnsafeTitle
source: Unsafe Water Quality!
bn: জলের মান অনিরাপদ!
hi: जल गुणवत्ता असुरक्षित!

# notificationUnsafeBody
source: Tap to view details
bn: বিস্তারিত দেখতে ট্যাপ করুন
hi: विस्तार देखने के लिए टैप करें

# riskBannerTitle
source: Unsafe Water Quality Detected!
bn: অনিরাপদ জলের মান সনাক্ত!
hi: असुरक्षित जल गुणवत्ता पाई गई!

# riskBannerSubtitle
source: Immediate action required ⚠️
bn: অবিলম্বে পদক্ষেপ নিন ⚠️
hi: तुरंत कार्रवाई आवश्यक ⚠️

source: Hello {name} 👋
bn: হ্যালো {name} 👋
hi: नमस्ते {name} 👋

# dashboardMotto
source: Trust yourself and keep going.
bn: নিজের ওপর ভরসা রাখুন ও এগিয়ে চলুন।
hi: खुद पर भरोसा रखें और आगे बढ़ते रहें.

# readingNitrate
source: Nitrate
bn: নাইট্রেট
hi: नाइट्रेट

# readingHigh
source: High
bn: উচ্চ
hi: उच्च

# farmHealthTitle
source: Farm Health Score
bn: খামারের স্বাস্থ্য স্কোর
hi: खेत स्वास्थ्य स्कोर

# farmHealthHint
source: {percent}% Healthy - Monitor water quality closely
bn: {percent}% সুস্থ - জলের মান নজরে রাখুন
hi: {percent}% स्वस्थ - जल गुणवत्ता पर नज़र रखें

# featureWaterIntake
source: Water Intake
bn: জল গ্রহণ
hi: जल सेवन

# featureReminders
source: Reminders
bn: রিমাইন্ডার
hi: रिमाइंडर्स

# featureDeviceStatus
source: Device Status
bn: ডিভাইস অবস্থা
hi: डिवाइस स्थिति

# featureSafeSources
source: Safe Sources
bn: নিরাপদ উৎস
hi: सुरक्षित स्रोत

# featureAlerts
source: Alerts
bn: সতর্কতা
hi: अलर्ट

# videoComingSoon
source: 🎥 Tutorial Video Coming Soon
bn: 🎥 টিউটোরিয়াল ভিডিও শীঘ্রই
hi: 🎥 ट्यूटोरियल वीडियो जल्द ही

source: Blockchain Services
bn: ব্লকচেইন পরিষেবা
hi: ब्लॉकचेन सेवाएँ

source: Wallet
bn: ওয়ালেট
hi: वॉलेट

source: Send Tx
bn: ট্রান্স্যাকশন পাঠান
hi: Tx भेजें

source: Subsidy
bn: সাবসিডি
hi: सब्सिडी

# fetchRiskFailed
source: Failed to fetch risk data
bn: ঝুঁকি ডেটা আনা যায়নি
hi: रिस्क डेटा प्राप्त करने में विफल

# bottomPair
source: Pair
bn: পেয়ার
hi: पेयर

# bottomDashboard
source: Dashboard
bn: ড্যাশবোর্ড
hi: डैशबोर्ड

# bottomMap
source: Map
bn: মানচিত্র
hi: मानचित्र

# bottomTips
source: Tips
bn: টিপস
hi: टिप्स

# waterIntakeTitle
source: Water Intake
bn: পানি গ্রহণ
hi: पानी का सेवन

source: Set Daily Goal
bn: দৈনিক লক্ষ্য নির্ধারণ করুন
hi: दैनिक लक्ष्य निर्धारित करें

# enterGoal
source: Enter goal in ml
bn: লক্ষ্য ml-এ লিখুন
hi: लक्ष्य ml में दर्ज करें

source: Cancel
bn: বাতিল
hi: रद्द करें

source: Save
bn: সংরক্ষণ করুন
hi: सहेजें

source: Daily Goal
bn: দৈনিক লক্ষ্য
hi: दैनिक लक्ष्य

source: Consumed
bn: গ্রহণ
hi: खपत

source: Hydration Reminders: ON
bn: হাইড্রেশন রিমাইন্ডার: চালু
hi: हाइड्रेशन रिमाइंडर: चालू

source: Hydration Reminders: OFF
bn: হাইড্রেশন রিমাইন্ডার: বন্ধ
hi: हाइड्रेशन रिमाइंडर: बंद

source: Next reminder
bn: পরবর্তী রিমাইন্ডার
hi: अगला रिमाइंडर

# weeklyTrend
source: Weekly Intake Trend
bn: সাপ্তাহিক গ্রহণের প্রবণতা
hi: साप्ताहिक सेवन रुझान

# todayLogs
source: Today's Logs
bn: আজকের রেকর্ড
hi: आज का रिकॉर्ड

# addWater
source: Add 250 ml
bn: ২৫০ ml যোগ করুন
hi: 250 ml जोड़ें

# remindersTitle
source: Crop Watering Reminders
bn: ফসল সেচের রিমাইন্ডার
hi: फसल सिंचाई अनुस्मारक

# recommendedTimes
source: Recommended Watering Times
bn: প্রস্তাবিত সেচের সময়
hi: अनुशंसित सिंचाई समय

# setCustomTimes
source: Set Custom Watering Times
bn: কাস্টম সেচের সময় নির্ধারণ করুন
hi: कस्टम सिंचाई समय सेट करें

source: Start
bn: শুরু
hi: शुरू करें

source: Stop
bn: বন্ধ
hi: रोकें

source: Select
bn: নির্বাচন করুন
hi: चुनें

source: Save Reminder
bn: রিমাইন্ডার সংরক্ষণ করুন
hi: अनुस्मारक सहेजें

source: Active Reminders
bn: সক্রিয় রিমাইন্ডার
hi: सक्रिय अनुस्मारक

source: Tips / Alerts
bn: টিপস / সতর্কতা
hi: सुझाव / अलर्ट

# tip1
source: Water early morning or late evening
bn: ভোরে বা সন্ধ্যায় পানি দিন
hi: सुबह जल्दी या शाम को पानी दें

# tip2
source: Avoid watering during heavy rain
bn: ভারী বৃষ্টির সময় পানি দেওয়া এড়িয়ে চলুন
hi: भारी बारिश के दौरान पानी देने से बचें

# tip3
source: Ensure irrigation lasts at least 2 hours
bn: সুনিশ্চিত করুন যে সেচ অন্তত ২ ঘণ্টা স্থায়ী হয়
hi: सुनिश्चित करें कि सिंचाई कम से कम 2 घंटे तक चले

# safeWaterSourcesTitle
source: Safe Water Sources
bn: নিরাপদ জল উৎস
hi: सुरक्षित जल स्रोत

# searchSourcesHint
source: Search sources...
bn: উৎস খুঁজুন...
hi: स्रोत खोजें...

source: Status
bn: অবস্থা
hi: स्थिति

source: Distance
bn: দূরত্ব
hi: दूरी

source: River
bn: নদী
hi: नदी

source: Well
bn: কুয়ো
hi: कुआँ

source: Pond
bn: পুকুর
hi: तालाब

source: Stream
bn: ঝর্ণা
hi: झरना

# statusGood
source: Good
bn: ভাল
hi: अच्छा

# statusModerate
source: Moderate
bn: মাঝারি
hi: मध्यम

# statusSafe
source: Safe
bn: নিরাপদ
hi: सुरक्षित

# statusUnsafe
source: Unsafe
bn: অসুরক্ষিত
hi: असुरक्षित

# deviceStatusTitle
source: Device Status
bn: ডিভাইসের অবস্থা
hi: डिवाइस की स्थिति

source: Connected Device
bn: সংযুক্ত ডিভাইস
hi: कनेक्टेड डिवाइस

source: Battery Level
bn: ব্যাটারির স্তর
hi: बैटरी स्तर

source: Device Connection
bn: ডিভাইস সংযোগ
hi: डिवाइस कनेक्शन

source: Connected
bn: সংযুক্ত
hi: कनेक्टेड

source: Disconnected
bn: বিচ্ছিন্ন
hi: डिस्कनेक्टेड

source: Connect
bn: সংযোগ করুন
hi: कनेक्ट करें

source: Disconnect
bn: সংযোগ বিচ্ছিন্ন করুন
hi: डिस्कनेक्ट करें

source: Sync Now
bn: এখন সিঙ্ক করুন
hi: अभी सिंक करें

source: Start Sync
bn: সিঙ্ক শুরু করুন
hi: सिंक शुरू करें

source: Last Update
bn: সর্বশেষ আপডেট
hi: आखिरी अपडेट

# lastUpdateMessage
source: Device synced 10 minutes ago
bn: ডিভাইস ১০ মিনিট আগে সিঙ্ক হয়েছে
hi: डिवाइस 10 मिनट पहले सिंक किया गया

source: Alerts
bn: সতর্কবার্তা
hi: चेतावनी

# unsafeWaterTitle
source: ⚠️ Unsafe Water Quality Detected!
bn: ⚠️ অনিরাপদ পানির মান সনাক্ত হয়েছে!
hi: ⚠️ असुरक्षित पानी की गुणवत्ता पाई गई!

# unsafeWaterMessage
source: Please check your water filter device or switch to a safe source.
bn: অনুগ্রহ করে আপনার জল ফিল্টার ডিভাইস পরীক্ষা করুন বা নিরাপদ উৎসে পরিবর্তন করুন।
hi: कृपया अपने पानी फ़िल्टर उपकरण की जाँच करें या सुरक्षित स्रोत पर स्विच करें।

# lowFilterTitle
source: Low Filter Efficiency
bn: ফিল্টারের কার্যক্ষমতা কম
hi: फ़िल्टर की कार्यक्षमता कम है

# lowFilterMessage
source: Your filter may need cleaning or replacement soon.
bn: আপনার ফিল্টার শীঘ্রই পরিষ্কার বা প্রতিস্থাপন প্রয়োজন হতে পারে।
hi: आपका फ़िल्टर जल्द ही सफाई या बदलने की आवश्यकता हो सकती है।

source: Resolve
bn: সমাধান করুন
hi: सुलझाएं

# scanningDevices
source: Scanning WiFi devices...
bn: ওয়াইফাই ডিভাইস স্ক্যান করা হচ্ছে...
hi: WiFi डिवाइस स्कैन हो रहा है...

source: No devices found ❌
bn: কোনো ডিভাইস পাওয়া যায়নি ❌
hi: कोई डिवाइस नहीं मिला ❌

source: Scan complete ✅
bn: স্ক্যান সম্পন্ন ✅
hi: स्कैन पूरा ✅

# connectingTo
source: Connecting to {deviceName}...
bn: {deviceName}-এর সাথে সংযোগ হচ্ছে...
hi: {deviceName} से कनेक्ट हो रहा है...

# connectedTo
source: Connected to {deviceName} ✅
bn: {deviceName}-এর সাথে সংযুক্ত ✅
hi: {deviceName} से कनेक्टेड ✅

# pairingWizard
source: Pairing Wizard: {deviceName}
bn: পেয়ারিং উইজার্ড: {deviceName}
hi: पेयरिंग विज़ार्ड: {deviceName}

# stepEnterWifiCredentials
source: Step 1: Enter WiFi credentials
bn: ধাপ ১: WiFi তথ্য প্রবেশ করান
hi: स्टेप 1: WiFi जानकारी डालें

source: Finish Pairing
bn: পেয়ারিং শেষ করুন
hi: पेयरिंग समाप्त करें

source: Device paired successfully 🎉
bn: ডিভাইস সফলভাবে পেয়ার করা হয়েছে 🎉
hi: डिवाइस सफलतापूर्वक पेयर किया गया 🎉

source: Scan Devices
bn: ডিভাইস স্ক্যান করুন
hi: डिवाइस स्कैन करें

source: Scanning...
bn: স্ক্যান করা হচ্ছে...
hi: स्कैन हो रहा है...

source: Battery
bn: ব্যাটারি
hi: बैटरी

# profileName
source: Hello {name}
bn: হ্যালো {name}
hi: नमस्ते {name}

# profilePhone
source: Phone
bn: ফোন
hi: फोन

# profileEdit
source: Edit Profile
bn: প্রোফাইল সম্পাদনা করুন
hi: प्रोफ़ाइल संपादित करें

# profileEditTapped
source: Edit Profile tapped
bn: প্রোফাইল সম্পাদনায় ট্যাপ করা হয়েছে
hi: प्रोफ़ाइल संपादित पर टैप किया गया

# profileSettings
source: Settings
bn: সেটিংস
hi: सेटिंग्स

# profileLogout
source: Logout
bn: লগ আউট
hi: लॉग आउट

source: Settings
bn: সেটিংস
hi: सेटिंग्स

source: Notifications
bn: বিজ্ঞপ্তি
hi: सूचनाएं

source: Language
bn: ভাষা
hi: भाषा

source: English
bn: ইংরেজি
hi: अंग्रेज़ी

# hindi
source: हिन्दी
bn: হিন্দি

source: Measurement Units
bn: পরিমাপ একক
hi: माप इकाइयाँ

# metricUnits
source: Metric (°C, Ltr)
bn: মেট্রিক (°C, লিটার)
hi: मेट्रिक (°C, लीटर)

# imperialUnits
source: Imperial (°F, Gallon)
bn: ইম্পেরিয়াল (°F, গ্যালন)
hi: इम्पीरियल (°F, गैलन)

source: Crop Type
bn: ফসলের ধরন
hi: फसल का प्रकार

source: Rice
bn: চাল
hi: चावल

source: Wheat
bn: গম
hi: गेहूं

source: Maize
bn: ভুট্টা
hi: मक्का

source: Season
bn: মৌসুম
hi: मौसम

source: Kharif
bn: খারিফ
hi: खरीफ

source: Rabi
bn: রাবি
hi: रबी

source: Zaid
bn: জায়েদ
hi: ज़ैद

source: Water Source
bn: জল উৎস
hi: जल स्रोत

source: Tubewell
bn: টিউবওয়েল
hi: ट्यूबवेल

source: Canal
bn: নালা
hi: नहर

source: Soil Type
bn: মাটির ধরন
hi: मिट्टी का प्रकार

source: Loamy
bn: দোঁমাট
hi: दोमट

source: Clay
bn: কাদা
hi: मिट्टी

source: Sandy
bn: বালি
hi: रेतीली

source: About App
bn: অ্যাপ সম্বন্ধে
hi: ऐप के बारे में

source: Help & Support
bn: সহায়তা এবং সমর্থন
hi: सहायता और समर्थन

source: Logout
bn: লগ আউট
hi: लॉग आउट

source: Reset Password
bn: পাসওয়ার্ড রিসেট
hi: पासवर्ड रीसेट

# resetPasswordComingSoon
source: Password reset coming soon!
bn: পাসওয়ার্ড রিসেট শীঘ্রই আসছে!
hi: पासवर्ड रीसेट जल्द ही आ रहा है!

# aboutAppDescription
source: VitaStream is your water safety and health companion app.
bn: VitaStream আপনার পানির সুরক্ষা ও স্বাস্থ্য সহায়ক অ্যাপ।
hi: VitaStream आपका पानी सुरक्षा और स्वास्थ्य साथी ऐप है।

# developedBy
source: Developed by Bristi & Amit 💙
bn: উন্নত করেছেন: ব্রিস্টি এবং অমিত 💙
hi: विकसित किया गया: बृस्ती और अमित 💙

# supportComingSoon
source: Support page coming soon!
bn: সাপোর্ট পেজ শীঘ্রই আসছে!
hi: सपोर्ट पेज जल्द ही आ रहा है!

source: ✅ Safe Water
bn: ✅ নিরাপদ পানি
hi: ✅ सुरक्षित पानी

source: ⚠️ Unsafe Water
bn: ⚠️ বিপজ্জনক পানি
hi: ⚠️ असुरक्षित पानी

source: pH Value
bn: pH মান
hi: pH मान

source: Last Sync
bn: শেষ সিঙ্ক
hi: अंतिम सिंक

# safeTips
source: 💧 Safe Water Tips
bn: 💧 নিরাপদ পানি পরামর্শ
hi: 💧 सुरक्षित पानी सुझाव

# boilWater
source: Boil water before drinking
bn: পানির আগে উবাল দিন
hi: पीने से पहले पानी उबालें

# useFilters
source: Use proper water filters
bn: সঠিক পানি ফিল্টার ব্যবহার করুন
hi: सही पानी फ़िल्टर का उपयोग करें

# cleanContainers
source: Store in clean containers
bn: পরিষ্কার কন্টেইনারে রাখুন
hi: साफ़ कंटेनरों में स्टोर करें

# unsafeActions
source: ⚠️ Unsafe Water Actions
bn: ⚠️ বিপজ্জনক পানি কার্যক্রম
hi: ⚠️ असुरक्षित पानी क्रियाएँ

# avoidDrinking
source: Avoid drinking until tested
bn: পরীক্ষা না হওয়া পর্যন্ত পান এড়িয়ে চলুন
hi: परीक्षण होने तक पीने से बचें

# reportAuthority
source: Report to local authority
bn: স্থানীয় কর্তৃপক্ষকে রিপোর্ট করুন
hi: स्थानीय प्राधिकरण को रिपोर्ट करें

# factLoading
source: 💡 Loading fact...
bn: 💡 তথ্য লোড হচ্ছে...
hi: 💡 तथ्य लोड हो रहा है...

# factFallback
source: 💡 Stay hydrated and safe!
bn: 💡 হাইড্রেটেড এবং নিরাপদ থাকুন!
hi: 💡 हाइड्रेटेड और सुरक्षित रहें!

# factError
source: 💡 Could not load fact. Try again later.
bn: 💡 তথ্য লোড করা যায়নি। পরে চেষ্টা করুন।
hi: 💡 तथ्य लोड नहीं हो सका। बाद में प्रयास करें।

# bengali
source: বাংলা
hi: बंगाली
